WildernessLabs/Netduino_SDK/NetMF4_4/DeviceCode/Targets/Native/STM32F4/DeviceCode/STM32F4_USBHost/STM32F4_usbhost_functions.cpp
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//  Copyright (c) Oberon microsystems, Inc.
//
//  *** USB OTG Full Speed Host Mode Driver ***
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


// todo:
// multiple controllers/ports
// multiple devices
// multiple interfaces
// dynamic channel allocation
// hub support
// suspend/resume
// power fail
// interrupt ep interval handling
// isochronous endpoints


#include <tinyhal.h>
#include <pal\com\usbhost\USBHost.h>
#include <pal\com\usbhost\USBHost_decl.h>

#ifdef STM32F4XX
#include "..\stm32f4xx.h"
#else
#include "..\stm32f2xx.h"
#endif

#include "usb_def.h"


void uart_printf( const char* text ) {
    int n = 0;
    while (text[n]) n++;
    USART_Flush( ConvertCOM_ComPort(USART_DEFAULT_PORT) );
    USART_Write( ConvertCOM_ComPort(USART_DEFAULT_PORT), text, n );
}
void print_hex(UINT32 val, UINT32 digits) {
    if (digits > 1) {
        print_hex(val >> 4, digits - 1);
        val &= 15;
    }
    if (val < 10) val += '0';
    else val += 'A' - 10;
    uart_printf((char*)&val);
}
void print_reg(UINT32 val) {
    print_hex(val, 8);
    uart_printf(" ");
}
void print_regs() {
    uart_printf("\r\n");
    uart_printf("GOTGCTL  GUSBCFG  GINTSTS  GCCFG    HCFG     HPRT\r\n");
    print_reg(OTG_FS->GOTGCTL);
    print_reg(OTG_FS->GUSBCFG);
    print_reg(OTG_FS->GINTSTS);
    print_reg(OTG_FS->GCCFG);
    if (OTG_FS->GINTSTS & 1) {
        print_reg(OTG_FS->HCFG);
        print_reg(OTG_FS->HPRT);
        print_reg(OTG_FS->HC[0].CHAR);
        print_reg(OTG_FS->HC[0].TSIZ);
    }
    uart_printf("\r\n");
}
void uart_init() {
        USART_Initialize( ConvertCOM_ComPort(USART_DEFAULT_PORT),
                          USART_DEFAULT_BAUDRATE, USART_PARITY_NONE, 8,
                          USART_STOP_BITS_ONE, USART_FLOW_NONE );
}
//#define USBH_Debug_Init uart_init()
//#define USBH_Debug(s)   uart_printf(s)
#define USBH_Debug_Init
#define USBH_Debug(s)

#ifdef DEBUG
#define _ASSERT(x) ASSERT(x)
#else
#define _ASSERT(x)
#endif


#if !defined(STM32F4_USBH_FS_USE_ID_PIN)
    #define STM32F4_USBH_FS_USE_ID_PIN 0
#endif
#if !defined(STM32F4_USBH_FS_USE_VB_PIN)
    #define STM32F4_USBH_FS_USE_VB_PIN 0
#endif
#if !defined(STM32F4_USBH_HS_USE_ID_PIN)
    #define STM32F4_USBH_HS_USE_ID_PIN 0
#endif
#if !defined(STM32F4_USBH_HS_USE_VB_PIN)
    #define STM32F4_USBH_HS_USE_VB_PIN 0
#endif

#if !defined(STM32F4_USBH_FS_POWER_PIN)
    #define STM32F4_USBH_FS_POWER_PIN GPIO_PIN_NONE
#endif
#if !defined(STM32F4_USBH_FS_POWER_LEVEL)
    #define STM32F4_USBH_FS_POWER_LEVEL 0 // active low
#endif
#if !defined(STM32F4_USBH_FS_FAULT_PIN)
    #define STM32F4_USBH_FS_FAULT_PIN GPIO_PIN_NONE
#endif
#if !defined(STM32F4_USBH_HS_POWER_PIN)
    #define STM32F4_USBH_HS_POWER_PIN GPIO_PIN_NONE
#endif
#if !defined(STM32F4_USBH_HS_POWER_LEVEL)
    #define STM32F4_USBH_HS_POWER_LEVEL 0 // active low
#endif
#if !defined(STM32F4_USBH_HS_FAULT_PIN)
    #define STM32F4_USBH_HS_FAULT_PIN GPIO_PIN_NONE
#endif


#define STM32F4_Num_CH_FS  8 // OTG FS supports 8 channels
#define STM32F4_Num_CH_HS 12 // OTG FS supports 12 channels


#if TOTAL_USBH_CONTROLLER == 2
    // USBH OTG Full Speed is controller 0
    // USBH OTG High Speed is controller 1
    
    #define STM32F4_USBH_REGS(c) (c ? OTG_HS : OTG_FS)
    
    #define STM32F4_USBH_IS_HS(c) c
    #define STM32F4_USBH_IDX(c) c
    #define STM32F4_USBH_FS_IDX 0
    #define STM32F4_USBH_HS_IDX 1
    
    #define STM32F4_USBH_DM_PIN(c) (c ? 30 : 11) // B14,A11
    #define STM32F4_USBH_DP_PIN(c) (c ? 31 : 12) // B15,A12
    #define STM32F4_USBH_VB_PIN(c) (c ? 29 :  9) // B13,A9
    #define STM32F4_USBH_ID_PIN(c) (c ? 28 : 10) // B12,A10
    
    #define STM32F4_USBH_USE_ID_PIN(c) (c ? STM32F4_USBH_HS_USE_ID_PIN : STM32F4_USBH_FS_USE_ID_PIN)
    #define STM32F4_USBH_USE_VB_PIN(c) (c ? STM32F4_USBH_HS_USE_VB_PIN : STM32F4_USBH_FS_USE_VB_PIN)
    #define STM32F4_USBH_POWER_PIN(c) (c ? STM32F4_USBH_HS_POWER_PIN : STM32F4_USBH_FS_POWER_PIN)
    #define STM32F4_USBH_POWER_LEVEL(c) (c ? STM32F4_USBH_HS_POWER_LEVEL : STM32F4_USBH_FS_POWER_LEVEL)
    #define STM32F4_USBH_FAULT_PIN(c) (c ? STM32F4_USBH_HS_FAULT_PIN : STM32F4_USBH_FS_FAULT_PIN)
    #define STM32F4_USBH_ALT_MODE(c) (GPIO_ALT_MODE)(c ? 0x2C2 : 0x2A2) // AF12,AF10, 50MHz
    
    #if USBH_MAX_QUEUES <= STM32F4_Num_CH_FS
        #define USBH_MAX_CH(c) USBH_MAX_QUEUES
        #define USBH_MAX_BUFFERS (2 * USBH_MAX_QUEUES - 2)
    #elif USBH_MAX_QUEUES <= STM32F4_Num_CH_HS
        #define USBH_MAX_CH(c) (c ? USBH_MAX_QUEUES : STM32F4_Num_CH_FS)
        #define USBH_MAX_BUFFERS (USBH_MAX_QUEUES + STM32F4_Num_CH_FS - 2)
    #else
        #define USBH_MAX_CH(c) (c ? STM32F4_Num_CH_HS : STM32F4_Num_CH_FS)
        #define USBH_MAX_BUFFERS (STM32F4_Num_CH_HS + STM32F4_Num_CH_FS - 2)
    #endif
    

#elif defined(STM32F4_USBH_HS)
    // use USBH OTG High Speed
    
    #define STM32F4_USBH_REGS(c) OTG_HS
    
    #define STM32F4_USBH_IS_HS(c) TRUE
    #define STM32F4_USBH_IDX(c) 0
    #define STM32F4_USBH_FS_IDX 0
    #define STM32F4_USBH_HS_IDX 0

    #define STM32F4_USBH_DM_PIN(c) 30 // B14
    #define STM32F4_USBH_DP_PIN(c) 31 // B15
    #define STM32F4_USBH_VB_PIN(c) 29 // B13
    #define STM32F4_USBH_ID_PIN(c) 28 // B12
    
    #define STM32F4_USBH_USE_ID_PIN(c) STM32F4_USBH_HS_USE_ID_PIN
    #define STM32F4_USBH_USE_VB_PIN(c) STM32F4_USBH_HS_USE_VB_PIN
    #define STM32F4_USBH_POWER_PIN(c) STM32F4_USBH_HS_POWER_PIN
    #define STM32F4_USBH_POWER_LEVEL(c) STM32F4_USBH_HS_POWER_LEVEL
    #define STM32F4_USBH_FAULT_PIN(c) STM32F4_USBH_HS_FAULT_PIN
    #define STM32F4_USBH_ALT_MODE(c) (GPIO_ALT_MODE)0x2C2; // AF12, 50MHz
    
    #if USBH_MAX_QUEUES <= STM32F4_Num_CH_HS
        #define USBH_MAX_CH(c) USBH_MAX_QUEUES
        #define USBH_MAX_BUFFERS (USBH_MAX_QUEUES - 1)
    #else
        #define USBH_MAX_CH(c) STM32F4_Num_CH_HS
        #define USBH_MAX_BUFFERS (STM32F4_Num_CH_HS - 1)
    #endif
    

#else
    // use OTG Full Speed
    
    #define STM32F4_USBH_REGS(c) OTG_FS
    
    #define STM32F4_USBH_IS_HS(c) FALSE
    #define STM32F4_USBH_IDX(c) 0
    #define STM32F4_USBH_FS_IDX 0
    #define STM32F4_USBH_HS_IDX 0
    
