WildernessLabs/Netduino_SDK/NetMF4_4/DeviceCode/Targets/Native/STM32F4/DeviceCode/STM32F4_USBHost/STM32F4_usbhost_functions.cpp
    #define STM32F4_USBH_DM_PIN(c) 11 // A11
    #define STM32F4_USBH_DP_PIN(c) 12 // A12
    #define STM32F4_USBH_VB_PIN(c)  9 // A9
    #define STM32F4_USBH_ID_PIN(c) 10 // A10
    
    #define STM32F4_USBH_USE_ID_PIN(c) STM32F4_USBH_FS_USE_ID_PIN
    #define STM32F4_USBH_USE_VB_PIN(c) STM32F4_USBH_FS_USE_VB_PIN
    #define STM32F4_USBH_POWER_PIN(c) STM32F4_USBH_FS_POWER_PIN
    #define STM32F4_USBH_POWER_LEVEL(c) STM32F4_USBH_FS_POWER_LEVEL
    #define STM32F4_USBH_FAULT_PIN(c) STM32F4_USBH_FS_FAULT_PIN
    #define STM32F4_USBH_ALT_MODE(c) (GPIO_ALT_MODE)0x2A2; // AF10, 50MHz
    
    #if USBH_MAX_QUEUES <= STM32F4_Num_CH_FS
        #define USBH_MAX_CH(c) USBH_MAX_QUEUES
        #define USBH_MAX_BUFFERS (USBH_MAX_QUEUES - 1)
    #else
        #define USBH_MAX_CH(c) STM32F4_Num_CH_FS
        #define USBH_MAX_BUFFERS (STM32F4_Num_CH_FS - 1)
    #endif
    
    
#endif


// FIFO sizes (in 32 bit words)
#define USBH_RXFIFO_SIZE  128 // 512 bytes
#define USBH_TXNFIFO_SIZE 128 // 512 bytes
#define USBH_TXPFIFO_SIZE  64 // 256 bytes


// State variables for one controller
typedef struct {
    USBH_CONTROLLER_STATE state;
    UINT16 endpointStatus[USBH_MAX_QUEUES];
    UINT8 epToChannel[16];  // per device
    HAL_COMPLETION timer; // delayed command processing
    BOOL initialized;
    BOOL pinsProtected;
    UINT16 errorCount[USBH_MAX_QUEUES];
} STM32F4_USBH_STATE;

/* State variables for the controllers */
static STM32F4_USBH_STATE STM32F4_USBH_ControllerState[TOTAL_USBH_CONTROLLER];

/* Queues for all data endpoints */
Hal_Queue_KnownSize<USB_PACKET64,USB_QUEUE_PACKET_COUNT> USBHQueueBuffers[USBH_MAX_BUFFERS];


void CPU_USBH_Initialize2( STM32F4_USBH_STATE *State );
void STM32F4_USBH_StartReset( STM32F4_USBH_STATE* State );
void STM32F4_USBH_StopRes( STM32F4_USBH_STATE* State );


/*
 * Initialize Channel Registers
 * type:
 *   OTG_HCCHAR_EPDIR   // direction IN
 *   OTG_HCCHAR_EPTYP_x // endpoint type
 */
void STM32F4_USBH_InitChannel (OTG_TypeDef* OTG, USBH_CONTROLLER_STATE* State,
                               UINT32 ch, UINT32 ep, UINT32 type)
{
    OTG->HC[ch].INT = 0xFFFFFFFF; // clear pending interrupts
    
    ((STM32F4_USBH_STATE*)State)->epToChannel[ep] = ch;
    
    OTG->HC[ch].INTMSK = OTG_HCINTMSK_XFRCM | OTG_HCINTMSK_STALLM | OTG_HCINTMSK_NAKM
                       | OTG_HCINTMSK_DTERRM | OTG_HCINTMSK_TXERRM
                       | OTG_HCINTMSK_BBERRM | OTG_HCINTMSK_FRMORM;
    type |= OTG_HCCHAR_MCNT_1         // 1 transaction per frame (periodic)
          | ep << 11                  // endpoint
          | State->Address << 22      // device address
          | State->MaxPacketSize[ch]; // max packet size
    if ((OTG->HPRT & OTG_HPRT_PSPD) == OTG_HPRT_PSPD_L) { // low speed
        type |= OTG_HCCHAR_LSDEV;
    }
    OTG->HC[ch].CHAR = type;
    OTG->HC[ch].TSIZ = ep ? OTG_HCTSIZ_DPID_D0 : OTG_HCTSIZ_DPID_D1;
    OTG->HAINTMSK |= (1 << ch);  // enable channel interrupt
}

// Halt a channel
void STM32F4_USBH_HaltChannel (OTG_TypeDef* OTG, UINT32 ch)
{
    OTG->HC[ch].INTMSK |= OTG_HCINTMSK_CHHM; // enable halted interrupt

    UINT32 chch = OTG->HC[ch].CHAR; // channel characteristics
    
    // get relevant queue status
    UINT32 qStatus;
    if (chch & OTG_HCCHAR_EPTYP_P) { // periodic endpoint
        qStatus = OTG->HPTXSTS;
    } else { // non-periodic endpoint
        qStatus = OTG->HNPTXSTS;
    }
    if (qStatus & OTG_HPTXSTS_PTQXSAV) { // queue space available
        OTG->HC[ch].CHAR = chch | (OTG_HCCHAR_CHENA | OTG_HCCHAR_CHDIS); // disable
    } else {
        OTG->HC[ch].CHAR = chch & ~OTG_HCCHAR_CHENA | OTG_HCCHAR_CHDIS; // flush
        // what exactly is the difference ?
    }
}

// Disable all channels
void STM32F4_USBH_Driver_DisableChannels (OTG_TypeDef* OTG, USBH_CONTROLLER_STATE* State)
{

    for (int ch = 0; ch < USBH_MAX_QUEUES; ch++) {
        if (OTG->HC[ch].CHAR & OTG_HCCHAR_CHENA) {
            ((STM32F4_USBH_STATE*)State)->errorCount[ch] = 5;
            STM32F4_USBH_HaltChannel(OTG, ch);
        }
    }
    
}


/*
 * Resume Event Interrupt Handler
 */
void STM32F4_USBH_Driver_ResumeEvent (OTG_TypeDef* OTG, USBH_CONTROLLER_STATE* State)
{
    // Device requested resume
    // resume bit set automatically
    
    STM32F4_USBH_STATE* state = (STM32F4_USBH_STATE*) State;
    
    // setup timer to clear resume bit after 20ms
    state->timer.Abort();
    state->timer.InitializeForISR((HAL_CALLBACK_FPN)STM32F4_USBH_StopRes, State);
    state->timer.EnqueueDelta(20000);
    
    State->DeviceState = USB_DEVICE_STATE_CONFIGURED;
    USBH_StateCallback( State );
}

/*
 * Device Attached Interrupt Handler
 */
void STM32F4_USBH_Driver_AttachedEvent (OTG_TypeDef* OTG, USBH_CONTROLLER_STATE* State)
{
    OTG->HAINTMSK = 0;
    
    // flush fifos
    while (!(OTG->GRSTCTL & OTG_GRSTCTL_AHBIDL)); // wait for AHB idle
    OTG->GRSTCTL |= OTG_GRSTCTL_TXFFLSH | OTG_GRSTCTL_TXF_ALL; // flush tx
    while (OTG->GRSTCTL & OTG_GRSTCTL_TXFFLSH); // wait for completion
    OTG->GRSTCTL |= OTG_GRSTCTL_RXFFLSH; // flush rx
    while (OTG->GRSTCTL & OTG_GRSTCTL_RXFFLSH); // wait for completion
    
    State->DeviceState = USB_DEVICE_STATE_ATTACHED;
    USBH_StateCallback( State );
}

/*
 * Device Detached Interrupt Handler
 */
void STM32F4_USBH_Driver_DetachedEvent (OTG_TypeDef* OTG, USBH_CONTROLLER_STATE* State)
{
    STM32F4_USBH_Driver_DisableChannels(OTG, State); // disable all channels
    
    State->DeviceState = USB_DEVICE_STATE_DETACHED;
    USBH_StateCallback( State );
}

/*
 * Device Enabled Interrupt Handler
 */
void STM32F4_USBH_Driver_EnabledEvent (OTG_TypeDef* OTG, USBH_CONTROLLER_STATE* State)
{
    // initialize channel 0: ep0 control
    STM32F4_USBH_InitChannel(OTG, State, 0, 0, OTG_HCCHAR_EPTYP_C);
    
    State->DeviceState = USB_DEVICE_STATE_DEFAULT;
    USBH_StateCallback( State );
}

