WildernessLabs/Netduino_SDK/NetMF4_4/DeviceCode/Targets/Native/STM32F4/DeviceCode/STM32F4_USBHost/STM32F4_usbhost_functions.cpp
/*
 * Device Disabled Interrupt Handler (Port Babble Error)
 */
void STM32F4_USBH_Driver_DisabledEvent (OTG_TypeDef* OTG, USBH_CONTROLLER_STATE* State)
{
    STM32F4_USBH_Driver_DisableChannels(OTG, State); // disable all channels
    
    UINT8 error = State->ConfigError;
    if (++error < 3) {
        // set state to Attached to re-initialize device
        State->DeviceState = USB_DEVICE_STATE_ATTACHED;
    } else {
        // give up and set state to Unusable
        State->DeviceState = USB_DEVICE_STATE_UNINITIALIZED;
    }
    USBH_StateCallback(State);
    State->ConfigError = error;
}

/*
 * Data Received Interrupt Handler
 */
void STM32F4_USBH_Driver_RX_Int (OTG_TypeDef* OTG, USBH_CONTROLLER_STATE* State,
                                 UINT32 ch, UINT32 count)
{
    ASSERT_IRQ_MUST_BE_OFF();
    
    UINT32* pd;
    
    UINT32 chch = OTG->HC[ch].CHAR; // channel characteristics
    UINT32 ep = chch >> 11 & 0xF;   // endpoint
    

    if (ep == 0) { // control endpoint
        USBH_Debug(count ? "c" : "z");
        
        pd = (UINT32*)State->Data;
        State->DataSize = count;
    } else { // data endpoint
        USBH_Debug("r");
        
        BOOL full;
        USB_PACKET64* Packet64 = USBH_RxEnqueue( State, ep, full );
        if (Packet64 == NULL) {  // should not happen
            USBH_Debug("?");
            _ASSERT(0);
        }
        pd = (UINT32*)Packet64->Buffer;
        Packet64->Size = count;
    }

    // read data
    volatile UINT32* ps = OTG->DFIFO[ch];
    for (int c = count; c > 0; c -= 4) {
        *pd++ = *ps;
    }
        
    // data handling & Rx reenabling delayed to transfer completed interrupt
}

/*
 * Data Transmit Interrupt Handler
 */
void STM32F4_USBH_Driver_TX_Int (OTG_TypeDef* OTG, USBH_CONTROLLER_STATE* State, UINT32 ch)
{
    ASSERT_IRQ_MUST_BE_OFF();
    
    // get channel characteristics
    UINT32 chch = OTG->HC[ch].CHAR & ~(OTG_HCCHAR_CHENA | OTG_HCCHAR_CHDIS);
    UINT32 ep = (chch >> 11) & 0xF;  // endpoint

    // get relevant queue status
    UINT32 qStatus;
    if (chch & OTG_HCCHAR_EPTYP_P) { // periodic endpoint
        qStatus = OTG->HPTXSTS;
    } else { // non-periodic endpoint
        qStatus = OTG->HNPTXSTS;
    }
    
    if (qStatus & OTG_HPTXSTS_PTQXSAV                     // queue space available
        && (qStatus & OTG_HPTXSTS_PTXFSAVL) >= 64 >> 2) { // fifo space available
        UINT32* ps = NULL;
        UINT32 count;

        if (ep == 0) { // control endpoint
            ps = (UINT32*)State->Data;
            count = State->DataSize;
            if (count == 0xFF) { // setup packet
                ps = (UINT32*)State->Request;
                count = USBH_SETUP_COUNT;
            }
            USBH_Debug(count ? "x" : "n");
        } else if (State->Queues[ep] != NULL && State->IsTxQueue[ep]) { // Tx data endpoint
            USB_PACKET64* Packet64 = USBH_TxDequeue( State, ep, FALSE ); // do not pop!
            if (Packet64) {  // data to send
                ps = (UINT32*)Packet64->Buffer;
                count = Packet64->Size;
                
                USBH_Debug("s");
            }
        }
        
        if (ps) { // data to send
            // enable channel
            OTG->HC[ch].TSIZ = OTG->HC[ch].TSIZ & OTG_HCTSIZ_DPID
                               | OTG_HCTSIZ_PKTCNT_1 | count;
            OTG->HC[ch].CHAR = chch | OTG_HCCHAR_CHENA;
            
            // write data
            volatile UINT32* pd = OTG->DFIFO[ch];
            for (int c = count; c > 0; c -= 4) {
                *pd = *ps++;
            }
        }
    } else {
        // schedule transfer later !!!
        // use OTG_GINTSTS_[N]PTXFE
    }
}

/*
 * Channel Interrupt Handler
 */
void STM32F4_USBH_Driver_Ch_Int (OTG_TypeDef* OTG, USBH_CONTROLLER_STATE* State, UINT32 ch)
{
    ASSERT_IRQ_MUST_BE_OFF();
    
    // get channel characteristics
    UINT32 chch = OTG->HC[ch].CHAR & ~(OTG_HCCHAR_CHENA | OTG_HCCHAR_CHDIS);
    UINT32 ep = (chch >> 11) & 0xF;  // endpoint
    
    UINT32 intPend = OTG->HC[ch].INT; // pending interrupts
    OTG->HC[ch].INT = intPend; // clear interrupts
/*    
    // only needed for multi transaction requests
    if (intPend & OTG_HCINT_ACK) { // ACK
        USBH_Debug(":");
        ((STM32F4_USBH_STATE*)State)->errorCount[ch] = 0;
    }
*/
    if (intPend & OTG_HCINT_XFRC) { // transaction completed
        USBH_Debug(">");
        ((STM32F4_USBH_STATE*)State)->errorCount[ch] = 0;
        // confirm data
        if (ep) { // stream data
            State->EndpointStatus[ep] = USBH_EP_OK;
            if (!(chch & OTG_HCCHAR_EPDIR)) { // direction OUT
                USBH_TxDequeue( State, ep, TRUE ); // advance queue pointer
            }
            // next transaction started below
        } else { // control channel
            UINT8 res = USBH_ControlCallback(State, USBH_EP_OK);
            if (res == USBH_TRANSFER_DONE) {
                return;
            } else {
                UINT8 actual = chch & OTG_HCCHAR_EPDIR ? USBH_TRANSFER_IN : USBH_TRANSFER_OUT;
                if (res != actual) { // direction change
                    chch ^= OTG_HCCHAR_EPDIR;
                    OTG->HC[ch].CHAR = chch;
                    OTG->HC[ch].TSIZ = OTG_HCTSIZ_DPID_D1; // start with data1
                }
                // next transaction started below
            }
        }
    } else if (intPend & OTG_HCINT_STALL) { // Stall
        USBH_Debug("#");
        ((STM32F4_USBH_STATE*)State)->errorCount[ch] = 4;
        STM32F4_USBH_HaltChannel(OTG, ch); // halt channel
        return;
    } else if (intPend & (OTG_HCINT_NAK | OTG_HCINT_DTERR)) { // NAK
        if (intPend & OTG_HCINT_DTERR) USBH_Debug(",");
        ((STM32F4_USBH_STATE*)State)->errorCount[ch] = 0;
        if (chch & OTG_HCCHAR_EPDIR && !(chch & OTG_HCCHAR_EPTYP_P)) { // bulk/ctrl IN
            if (OTG->HPRT & OTG_HPRT_PENA) {
                OTG->HC[ch].CHAR = chch | OTG_HCCHAR_CHENA; // reschedule IN transaction
            }
        } else { // interrupt or OUT
            STM32F4_USBH_HaltChannel(OTG, ch); // halt channel
        }
        return;
    } else if (intPend & (OTG_HCINT_TXERR | OTG_HCINT_BBERR | OTG_HCINT_FRMOR)) {
        USBH_Debug("!");
        if (intPend & OTG_HCINT_BBERR) USBH_Debug("b");
        if (intPend & OTG_HCINT_FRMOR) USBH_Debug("f");
        ((STM32F4_USBH_STATE*)State)->errorCount[ch]++;
        STM32F4_USBH_HaltChannel(OTG, ch); // halt channel
        return;
    } else if (intPend & OTG_HCINT_CHH) { // channel halted
        USBH_Debug("h");
        OTG->HC[ch].INTMSK &= ~OTG_HCINTMSK_CHHM; // disable halted interrupt
        switch (((STM32F4_USBH_STATE*)State)->errorCount[ch]) {
        case 3: // error after 3 retries
            if (ep == 0) USBH_ControlCallback(State, USBH_EP_ERROR);
            else State->EndpointStatus[ep] = USBH_EP_ERROR;
            return;
        case 4: // STALL
            if (ep == 0) USBH_ControlCallback(State, USBH_EP_STALL);
            else State->EndpointStatus[ep] = USBH_EP_STALL;
            return;
        case 5: // detached / port error
            return;
        default: // NAK or error retry
            // next transaction started below
        } 
    } else {
        return;
    }
    
    if (!(OTG->HPRT & OTG_HPRT_PENA)) { // device disconnected
        return;
    }
    
    // Start new transaction
    
    if (chch & OTG_HCCHAR_EPTYP_P) { // periodic channel
        chch ^= OTG_HCCHAR_ODDFRM; // toggle even/odd frame
        OTG->HC[ch].CHAR = chch;
    }
    
    if (chch & OTG_HCCHAR_EPDIR) { // direction IN 
    
        if (ep != 0 && State->Queues[ep]->IsFull()) { // no receive buffer
            return;
        }
        
