WildernessLabs/Netduino_SDK/NetMF4_4/DeviceCode/Targets/Native/STM32F4/DeviceCode/STM32F4_USBHost/STM32F4_usbhost_functions.cpp
        USBH_Debug("$");
        
        // check queue space ???
        
        // enable channel
        OTG->HC[ch].TSIZ = OTG->HC[ch].TSIZ & OTG_HCTSIZ_DPID
                           | OTG_HCTSIZ_PKTCNT_1 | State->MaxPacketSize[ep];
        OTG->HC[ch].CHAR = chch | OTG_HCCHAR_CHENA; // start IN transaction
        
    } else { // direction OUT
        STM32F4_USBH_Driver_TX_Int(OTG, State, ch);
    }
}


/*
 * Main Interrupt Handler
 */
void STM32F4_USBH_Driver_Interrupt (OTG_TypeDef* OTG, USBH_CONTROLLER_STATE* State)
{
    INTERRUPT_START;

    UINT32 intPend = OTG->GINTSTS; // get pending bits
    
    while (intPend & OTG_GINTSTS_RXFLVL) { // RxFifo non empty
        UINT32 status = OTG->GRXSTSP; // read and pop status word from fifo
        int ch = status & OTG_GRXSTSP_CHNUM;
        int count = (status & OTG_GRXSTSP_BCNT) >> 4;
        status &= OTG_GRXSTSP_PKTSTS;
        if (status == OTG_GRXSTSP_PKTSTS_PR) { // data received
            STM32F4_USBH_Driver_RX_Int(OTG, State, ch, count);
/*
        } else if (status == OTG_GRXSTSP_PKTSTS_DC) { // in transaction completed
            USBH_Debug("<");
        } else if (status == OTG_GRXSTSP_PKTSTS_CH) { // halt
            USBH_Debug("H");
        } else { // OTG_GRXSTSP_PKTSTS_TE  toggle error
            USBH_Debug("g");
*/
        }
        intPend = OTG->GINTSTS; // update pending bits
    }
    
    if (intPend & OTG_GINTSTS_HCINT) { // host channel interrupt
        UINT32 bits = OTG->HAINT & 0xFFFF; // pending channels
        int ch = 0;
        while (bits) {
            if (bits & 1) STM32F4_USBH_Driver_Ch_Int(OTG, State, ch);
            ch++;
            bits >>= 1;
        }         
    }
    if (intPend & OTG_GINTSTS_HPRTINT) { // host port interrupt
        UINT32 hprt = OTG->HPRT;
/*        
        if (hprt & OTG_HPRT_POCCHNG) { // overcurrent
            USBH_Debug("O");
        }
*/
        if (hprt & OTG_HPRT_PENCHNG) {
            if (hprt & OTG_HPRT_PENA) { // enabled
                USBH_Debug("E");
                STM32F4_USBH_Driver_EnabledEvent(OTG, State);
            } else { // disabled (detached, overcurrent, or babble)
                if (hprt & OTG_HPRT_POCA) { // overcurrent
                    USBH_Debug("o");
                } else if (!(hprt & OTG_HPRT_PCSTS)) { // detached
                    if (!(intPend & OTG_GINTSTS_DISCINT)) USBH_Debug("d");
                } else { // babble error
                    USBH_Debug("B");
                    // re-enable port
                    STM32F4_USBH_Driver_DisabledEvent(OTG, State);
                }
            }
        }
        if (hprt & OTG_HPRT_PCDET) { // attach detected
            USBH_Debug("A");
            STM32F4_USBH_Driver_AttachedEvent(OTG, State);
        }
        // clear interrupt bits but preserve enabled state!
        OTG->HPRT = hprt & ~OTG_HPRT_PENA;
    }
    
    if (intPend & OTG_GINTSTS_SOF) { // start of frame
        // schedule interrupt requests !!!
        OTG->GINTSTS = OTG_GINTSTS_SOF; // clear interrupt
    }
    if (intPend & OTG_GINTSTS_DISCINT) { // detached
        if (!(OTG->HPRT & OTG_HPRT_PCSTS)) {
            USBH_Debug("D");
            STM32F4_USBH_Driver_DetachedEvent(OTG, State);
        }
        OTG->GINTSTS = OTG_GINTSTS_DISCINT; // clear interrupt
    }
    if (intPend & OTG_GINTSTS_WKUPINT) { // wakeup
        USBH_Debug("R");
        STM32F4_USBH_Driver_ResumeEvent(OTG, State);
        OTG->GINTSTS = OTG_GINTSTS_WKUPINT; // clear interrupt
    }
    
/*
    if (intPend & OTG_GINTSTS_PTXFE) { // periodic Tx Fifo empty
        // write packet to fifo and queue
        // or
        // disable interrupt
    }
    if (intPend & OTG_GINTSTS_NPTXFE) { // non-periodic Tx Fifo empty
        // write packet to fifo and queue
        // or
        // disable interrupt
    }
*/    
    
    INTERRUPT_END;
}

/*
 * OTG FS Interrupt Handler
 */
void STM32F4_USBH_Driver_FS_Interrupt (void* param)
{
    STM32F4_USBH_Driver_Interrupt(OTG_FS, &STM32F4_USBH_ControllerState[STM32F4_USBH_FS_IDX].state);
}

/*
 * OTG HS Interrupt Handler
 */
void STM32F4_USBH_Driver_HS_Interrupt (void* param)
{
    STM32F4_USBH_Driver_Interrupt(OTG_HS, &STM32F4_USBH_ControllerState[STM32F4_USBH_HS_IDX].state);
}

/*
 * Power Fault Interrupt Handler
 */
void STM32F4_USBH_Driver_Fault_Interrupt (GPIO_PIN Pin, BOOL PinState, void* Param)
{
    INTERRUPT_START;
    USBH_CONTROLLER_STATE* State = (USBH_CONTROLLER_STATE*)Param;
    OTG_TypeDef* OTG = STM32F4_USBH_REGS(State->ControllerNum);

    // disable bus power
//    if (STM32F4_USBH_POWER_PIN(Controller) != GPIO_PIN_NONE) {
//            CPU_GPIO_DisablePin(STM32F4_USBH_POWER_PIN(Controller),
//                            RESISTOR_DISABLED, 0, GPIO_ALT_PRIMARY);
//    }

    // reset power and enable bits, preserve interrupts
//    OTG->HPRT &= ~(OTG_HPRT_PPWR | OTG_HPRT_POCCHNG | OTG_HPRT_PENCHNG | OTG_HPRT_PCDET);
    
    USBH_Debug("F");
    
    INTERRUPT_END;
}

USBH_CONTROLLER_STATE * CPU_USBH_GetState( int Controller )
{
    if ((UINT32)Controller >= TOTAL_USBH_CONTROLLER) return NULL;
    return &STM32F4_USBH_ControllerState[STM32F4_USBH_IDX(Controller)].state;
}

HRESULT CPU_USBH_Initialize( int Controller )
{
    USBH_Debug_Init;

    if ((UINT32)Controller >= TOTAL_USBH_CONTROLLER) return S_FALSE;
    
    STM32F4_USBH_STATE *State = &STM32F4_USBH_ControllerState[STM32F4_USBH_IDX(Controller)];
    
    if (State->initialized) return S_OK;
    State->initialized = TRUE;
    
    // enable USB clock
    if (STM32F4_USBH_IS_HS(Controller)) { // HS on AHB1
        RCC->AHB1ENR |= RCC_AHB1ENR_OTGHSEN;
        // this is needed to enable the FS phy clock when the CPU is sleeping
        RCC->AHB1LPENR &= ~RCC_AHB1LPENR_OTGHSULPILPEN;
    } else { // FS on AHB2
        RCC->AHB2ENR |= RCC_AHB2ENR_OTGFSEN;
    }
    
    // setup pins
    State->pinsProtected = TRUE;
    CPU_USBH_ProtectPins(Controller, FALSE);
    
    // handle power fault pin
    if (STM32F4_USBH_FAULT_PIN(Controller) != GPIO_PIN_NONE) {
        CPU_GPIO_EnableInputPin2(STM32F4_USBH_FAULT_PIN(Controller), FALSE,
            STM32F4_USBH_Driver_Fault_Interrupt, State, GPIO_INT_EDGE_LOW, RESISTOR_PULLUP);
    }
    
    // setup usb state variables
    State->state.EndpointStatus = State->endpointStatus;
    State->state.EndpointCount  = USBH_MAX_CH(Controller);
    
    OTG_TypeDef* OTG = STM32F4_USBH_REGS(Controller);

