WildernessLabs/Netduino_SDK/NetMF4_4/DeviceCode/Targets/Native/STM32F4/DeviceCode/STM32F4_USBHost/STM32F4_usbhost_functions.cpp
    GLOBAL_LOCK(irq);
    
    OTG->GAHBCFG = 0; // global interrupt disable
    OTG->GUSBCFG |= OTG_GUSBCFG_PHYSEL;  // internal PHY

    int n;
    do {
        while (!(OTG->GRSTCTL & OTG_GRSTCTL_AHBIDL)); // wait for AHB idle
        OTG->GRSTCTL |= OTG_GRSTCTL_CSRST; // start core soft reset
        n = 100000;
        while (OTG->GRSTCTL & OTG_GRSTCTL_CSRST && --n); // wait for reset completed or timeout
    } while(n == 0); // repeat reset if wait timed out

    OTG->GCCFG  |= OTG_GCCFG_VBUSASEN       // A device Vbus sensing
                 | OTG_GCCFG_PWRDWN;        // transceiver enabled
    
    // no automatic device - host switch
    if (STM32F4_USBH_USE_VB_PIN(Controller) == 0) { // no Vbus pin
        OTG->GCCFG |= OTG_GCCFG_NOVBUSSENS; // disable vbus sense
    }
    OTG->GUSBCFG |= OTG_GUSBCFG_FHMOD;      // force host mode
                

    // enable bus power driver
    if (STM32F4_USBH_POWER_PIN(Controller) != GPIO_PIN_NONE) {
        CPU_GPIO_EnableOutputPin(STM32F4_USBH_POWER_PIN(Controller), STM32F4_USBH_POWER_LEVEL(Controller));
    }
    
    // Continue initialization after 200ms power up delay
    State->timer.Abort();
    State->timer.InitializeForISR((HAL_CALLBACK_FPN)CPU_USBH_Initialize2, State);
    State->timer.EnqueueDelta(200000);
    
    return S_OK;
}

// Second (delayed) part of initialization
void CPU_USBH_Initialize2( STM32F4_USBH_STATE *State )
{
    OTG_TypeDef* OTG = STM32F4_USBH_REGS(State->ControllerNum);

    GLOBAL_LOCK(irq);
    
    OTG->HPRT |= OTG_HPRT_PPWR; // set bus power, reset enable & interrupts
    OTG->PCGCCTL = 0;
    
    // configure Fifos
    OTG->GRXFSIZ = USBH_RXFIFO_SIZE; // Rx Fifo
    OTG->HNPTXFSIZ = (USBH_TXNFIFO_SIZE << 16) | USBH_RXFIFO_SIZE; // NP Tx Fifo
    OTG->HPTXFSIZ = (USBH_TXPFIFO_SIZE << 16) | USBH_RXFIFO_SIZE + USBH_TXNFIFO_SIZE; // P Tx Fifo

    // configure interrupts
    OTG->HAINTMSK = 0;
    OTG->GINTSTS = 0xFFFFFFFF; // clear all interrupts
    OTG->GINTMSK = OTG_GINTMSK_RXFLVLM | OTG_GINTMSK_SOFM | OTG_GINTMSK_WUIM
                 | OTG_GINTMSK_HCIM | OTG_GINTMSK_HPRTIM | OTG_GINTMSK_DISCINT;
/*
                 | OTG_GINTMSK_NPTXFEM | OTG_GINTMSK_PTXFEM; // tx fifo empty interrupts
                 | OTG_GINTMSK_SRQIM | OTG_GINTMSK_CIDSCHG;  // id status change 
*/                
    // set interrupt handlers
    if (STM32F4_USBH_IS_HS(State->ControllerNum)) { // HS
        CPU_INTC_ActivateInterrupt(OTG_HS_IRQn,      STM32F4_USBH_Driver_HS_Interrupt, 0);
        CPU_INTC_ActivateInterrupt(OTG_HS_WKUP_IRQn, STM32F4_USBH_Driver_HS_Interrupt, 0);
    } else { // FS
        CPU_INTC_ActivateInterrupt(OTG_FS_IRQn,      STM32F4_USBH_Driver_FS_Interrupt, 0);
        CPU_INTC_ActivateInterrupt(OTG_FS_WKUP_IRQn, STM32F4_USBH_Driver_FS_Interrupt, 0);
    }
    
    OTG->GAHBCFG |= OTG_GAHBCFG_GINTMSK; // global interrupt enable
    
    USBH_Debug("*");
}

HRESULT CPU_USBH_Uninitialize( int Controller )
{
    if (STM32F4_USBH_IS_HS(Controller)) { // HS
        CPU_INTC_DeactivateInterrupt(OTG_HS_WKUP_IRQn);
        CPU_INTC_DeactivateInterrupt(OTG_HS_IRQn);
    } else { // FS
        CPU_INTC_DeactivateInterrupt(OTG_FS_WKUP_IRQn);
        CPU_INTC_DeactivateInterrupt(OTG_FS_IRQn);
    }
    
    OTG_TypeDef* OTG = STM32F4_USBH_REGS(Controller);
    
    GLOBAL_LOCK(irq);
    
    OTG->HPRT &= ~OTG_HPRT_PPWR; // reset power, enable & interrupt bits
    
    // disable power fault interrupt
    if (STM32F4_USBH_FAULT_PIN(Controller) != GPIO_PIN_NONE) {
        CPU_GPIO_DisablePin(STM32F4_USBH_FAULT_PIN(Controller),
                            RESISTOR_DISABLED, 0, GPIO_ALT_PRIMARY);
    }
    
    // disable bus power driver
    if (STM32F4_USBH_POWER_PIN(Controller) != GPIO_PIN_NONE) {
        CPU_GPIO_DisablePin(STM32F4_USBH_POWER_PIN(Controller),
                            RESISTOR_DISABLED, 0, GPIO_ALT_PRIMARY);
    }

    CPU_USBH_ProtectPins(Controller, TRUE);
    
    // disable USB clock
    if (STM32F4_USBH_IS_HS(Controller)) { // HS on AHB1
        RCC->AHB1ENR &= ~RCC_AHB1ENR_OTGHSEN;
    } else { // FS on AHB2
        RCC->AHB2ENR &= ~RCC_AHB2ENR_OTGFSEN;
    }
    
    STM32F4_USBH_ControllerState[STM32F4_USBH_IDX(Controller)].initialized = FALSE;

    return S_OK;
}

/* 
 * Reset device address & control channel packet size
 * according to the changes in the controller state
 */
void CPU_USBH_SetControl (USBH_CONTROLLER_STATE* State)
{
    if (State == NULL) return;

    OTG_TypeDef* OTG = STM32F4_USBH_REGS(State->ControllerNum);
    
    // control channel only
    OTG->HC[0].CHAR = OTG->HC[0].CHAR
                      & ~(OTG_HCCHAR_CHENA | OTG_HCCHAR_CHDIS | OTG_HCCHAR_DAD)
                      | (State->Address << 22)
                      | State->MaxPacketSize[0];
}

/*
 * Open a Channel for the given endpoint
 */
void CPU_USBH_OpenChannel (USBH_CONTROLLER_STATE* State, const USB_ENDPOINT_DESCRIPTOR* pEp)
{
    OTG_TypeDef* OTG = STM32F4_USBH_REGS(State->ControllerNum);
    
    USBH_Debug("l");

    UINT32 ep = pEp->bEndpointAddress & 0x0F;
    UINT32 ch = ep; // !!!
    State->Queues[ep] = &USBHQueueBuffers[ep - 1];
    State->MaxPacketSize[ep] = pEp->wMaxPacketSize;
    BOOL isTx = TRUE;
    UINT32 type = pEp->bmAttributes << 18; // OTG_HCCHAR_EPTYP_x
    if (pEp->bEndpointAddress & USB_ENDPOINT_DIRECTION_IN) {
        isTx = FALSE;
        type |= OTG_HCCHAR_EPDIR;
    }
    State->IsTxQueue[ep] = isTx;
    State->EndpointStatus[ep] = USBH_EP_OK;
    STM32F4_USBH_InitChannel(OTG, State, ch, ep, type);
}

/*
 * Start a control channel transfer by sending the initial Setup packet
 */
BOOL CPU_USBH_StartSetup( USBH_CONTROLLER_STATE* State )
{
    if (State == NULL) return FALSE;

    OTG_TypeDef* OTG = STM32F4_USBH_REGS(State->ControllerNum);

    USBH_Debug("C");

    GLOBAL_LOCK(irq);
    
    ((STM32F4_USBH_STATE*)State)->errorCount[0] = 0;
    
    // setup packet on endpoint 0 OUT channel
    OTG->HC[0].TSIZ = OTG_HCTSIZ_DPID_MS | OTG_HCTSIZ_PKTCNT_1 | USBH_SETUP_COUNT;
    OTG->HC[0].CHAR = OTG->HC[0].CHAR & ~(OTG_HCCHAR_CHDIS | OTG_HCCHAR_EPDIR)
                      | OTG_HCCHAR_CHENA; // enable channel
    
