WildernessLabs/Netduino_SDK/NetMF4_4/DeviceCode/Targets/Native/STM32F4/DeviceCode/STM32F4_USBHost/STM32F4_usbhost_functions.cpp
    // Write packet to fifo
    *OTG->DFIFO[0] = ((UINT32*)State->Request)[0];
    *OTG->DFIFO[0] = ((UINT32*)State->Request)[1];
    
    State->DataSize = 0xFF; // Setup packet marker (for error repeat)
    
    return TRUE;
}

BOOL CPU_USBH_StartOutput( USBH_CONTROLLER_STATE* State, int ep )
{
    if (State == NULL || ep >= State->EndpointCount) return FALSE;

    OTG_TypeDef* OTG = STM32F4_USBH_REGS(State->ControllerNum);

    USBH_Debug("t");
    
    GLOBAL_LOCK(irq);

    // If endpoint is not an output
    if( State->Queues[ep] == NULL || !State->IsTxQueue[ep] )
        return FALSE;

    UINT32 ch = ((STM32F4_USBH_STATE*)State)->epToChannel[ep];
    
    if ((OTG->HC[ch].CHAR & (OTG_HCCHAR_CHDIS | OTG_HCCHAR_CHENA)) == 0) {
        // reset error count
        ((STM32F4_USBH_STATE*)State)->errorCount[ch] = 0;
        // write first packet
        STM32F4_USBH_Driver_TX_Int(OTG, State, ch);
    }
    
    return TRUE;
}

BOOL CPU_USBH_RxEnable( USBH_CONTROLLER_STATE* State, int ep )
{

    // If this is not a legal Rx queue
    if( State == NULL || State->Queues[ep] == NULL || State->IsTxQueue[ep] )
        return FALSE;
        
    // If endpoint is halted
    if (State->EndpointStatus[ep] != USBH_EP_OK) {
        return FALSE;
    }

    OTG_TypeDef* OTG = STM32F4_USBH_REGS(State->ControllerNum);

    GLOBAL_LOCK(irq);
    
    // enable Rx
    UINT32 ch = ((STM32F4_USBH_STATE*)State)->epToChannel[ep];
    UINT32 chch = OTG->HC[ch].CHAR;
    if ((chch & (OTG_HCCHAR_CHDIS | OTG_HCCHAR_CHENA)) == 0) { // channel not in use
    
        USBH_Debug("e");
        // reset error count
        ((STM32F4_USBH_STATE*)State)->errorCount[ch] = 0;
        // enable channel
        // check queue space ???
        OTG->HC[ch].TSIZ = OTG->HC[ch].TSIZ & OTG_HCTSIZ_DPID
                           | OTG_HCTSIZ_PKTCNT_1 | State->MaxPacketSize[ep];
        if (chch & OTG_HCCHAR_EPTYP_P) { // periodic channel
            chch |= OTG_HCCHAR_ODDFRM; // set ODDFRM
            chch ^= (OTG->HFNUM & 1) << 29; // clear ODDFRM if next frame is even
        }
        OTG->HC[ch].CHAR = chch | OTG_HCCHAR_CHENA; // start IN poll
    }
    
    return TRUE;
}

void CPU_USBH_PortReset( USBH_CONTROLLER_STATE* State )
{
    STM32F4_USBH_STATE* state = (STM32F4_USBH_STATE*) State;
    
    // setup timer to start reset after 10ms
    state->timer.Abort();
    state->timer.InitializeForISR((HAL_CALLBACK_FPN)STM32F4_USBH_StartReset, State);
    state->timer.EnqueueDelta(10000);
}

// set bus speed and start reset signaling
void STM32F4_USBH_StartReset( STM32F4_USBH_STATE* State )
{
    OTG_TypeDef* OTG = STM32F4_USBH_REGS(State->state.ControllerNum);
    
    // preserve interrupt and enable bits
    UINT32 hprt = OTG->HPRT & ~(OTG_HPRT_POCCHNG | OTG_HPRT_PENCHNG | OTG_HPRT_PCDET | OTG_HPRT_PENA);

    // configure bus speed based on pin states
    if ((hprt & OTG_HPRT_PSPD) == OTG_HPRT_PSPD_L) { // low speed (1.5MBit)
        USBH_Debug("L");
        OTG->HFIR = 6000; // frame interval (1ms @ 6MHz)
        OTG->HCFG = OTG->HCFG & ~OTG_HCFG_FSLSPCS | (OTG_HCFG_FSLSS | OTG_HCFG_FSLSPCS6);
    } else { // full speed (12MBit)
        OTG->HFIR = 48000; // frame interval (1ms @ 48MHz)
        OTG->HCFG = OTG->HCFG & ~OTG_HCFG_FSLSPCS | (OTG_HCFG_FSLSS | OTG_HCFG_FSLSPCS48);
    }
    
    USBH_Debug("T");

    // start bus reset signaling
    OTG->HPRT = hprt | OTG_HPRT_PRST;
    
    // setup timer to clear reset bit after 15ms
    State->timer.Abort();
    State->timer.InitializeForISR((HAL_CALLBACK_FPN)STM32F4_USBH_StopRes, State);
    State->timer.EnqueueDelta(15000);
}

// Stop reset or resume signaling
void STM32F4_USBH_StopRes( STM32F4_USBH_STATE* State )
{
    OTG_TypeDef* OTG = STM32F4_USBH_REGS(State->state.ControllerNum);
    
    // clear reset/resume and preserve interrupt and enable bits
    OTG->HPRT &= ~(OTG_HPRT_POCCHNG | OTG_HPRT_PENCHNG | OTG_HPRT_PCDET
                   | OTG_HPRT_PENA | OTG_HPRT_PRST | OTG_HPRT_PRES);
}

void CPU_USBH_Suspend( USBH_CONTROLLER_STATE* State )
{
    OTG_TypeDef* OTG = STM32F4_USBH_REGS(State->ControllerNum);
    
    // preserve interrupt and enable bits
    UINT32 hprt = OTG->HPRT & ~(OTG_HPRT_POCCHNG | OTG_HPRT_PENCHNG | OTG_HPRT_PCDET | OTG_HPRT_PENA);
    OTG->HPRT = hprt | OTG_HPRT_PSUSP; // set suspend bit
    
    // suspend bit cleared automatically
    
    State->DeviceState = USB_DEVICE_STATE_SUSPENDED;
    USBH_StateCallback( State );
}

void CPU_USBH_Resume( USBH_CONTROLLER_STATE* State )
{
    STM32F4_USBH_STATE* state = (STM32F4_USBH_STATE*) State;
    OTG_TypeDef* OTG = STM32F4_USBH_REGS(State->ControllerNum);
    
    // preserve interrupt and enable bits
    UINT32 hprt = OTG->HPRT & ~(OTG_HPRT_POCCHNG | OTG_HPRT_PENCHNG | OTG_HPRT_PCDET | OTG_HPRT_PENA);
    OTG->HPRT = hprt | OTG_HPRT_PRES; // set resume bit
    
    // setup timer to clear resume bit after 20ms
    state->timer.Abort();
    state->timer.InitializeForISR((HAL_CALLBACK_FPN)STM32F4_USBH_StopRes, State);
    state->timer.EnqueueDelta(20000);

    State->DeviceState = USB_DEVICE_STATE_CONFIGURED;
    USBH_StateCallback( State );
}


BOOL CPU_USBH_ProtectPins( int Controller, BOOL On )
{
    STM32F4_USBH_STATE *State = &STM32F4_USBH_ControllerState[STM32F4_USBH_IDX(Controller)];

    if (!State->initialized) return FALSE;  // not yet initialized

    OTG_TypeDef* OTG = STM32F4_USBH_REGS(Controller);

    GLOBAL_LOCK(irq);

    if (On) {
        if (!State->pinsProtected) {

            USBH_Debug("+");

            State->pinsProtected = TRUE;

            // clear USB Txbuffer
            for(int ep = 1; ep < State->state.EndpointCount; ep++) {
                if (State->state.Queues[ep] && State->state.IsTxQueue[ep]) {
                    while (USBH_TxDequeue( &State->state, ep, TRUE ) != NULL);  // clear TX queue
                }
            }
        }
    } else {
        if (State->pinsProtected) {

            USBH_Debug("-");

            State->pinsProtected = FALSE;

            GPIO_ALT_MODE altMode = STM32F4_USBH_ALT_MODE(Controller);
            CPU_GPIO_DisablePin(STM32F4_USBH_DM_PIN(Controller), RESISTOR_DISABLED, 0, altMode);
            CPU_GPIO_DisablePin(STM32F4_USBH_DP_PIN(Controller), RESISTOR_DISABLED, 0, altMode);
            if (STM32F4_USBH_USE_ID_PIN(Controller)) {
                CPU_GPIO_DisablePin(STM32F4_USBH_ID_PIN(Controller), RESISTOR_DISABLED, 0, altMode);
            }
        }
    }

    return TRUE;
}
